Revit 2027 API
BuiltInFailures.PathOfTravelFailures Class
 Failures about PathOfTravel.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PathOfTravelFailures
Public NotInheritable Class PathOfTravelFailures
public ref class PathOfTravelFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PathOfTravelFailures = class end
The BuiltInFailures.PathOfTravelFailures type exposes the following members.
Properties
Name | Description
CannotBePasted |  Path of Travel cannot be pasted into this view.
ResultAffectedByCrop |  A crop region is enabled in the view. The Path of Travel may not be the optimized route because it is calculating only inside the crop region. Consider uncropping the view and placing another Path of Travel to ensure you see the optimized route.
UpdateFailureMultiple |  [Number] Path of Travel lines failed to update. [Reason for failure]
UpdateFailureSingle |  Path of Travel failed to update.
UpdateSummary |  [Number] Path of Travel lines successfully updated. [Number] Path of Travel lines failed to update.
Top
See Also
Reference
Autodesk.Revit.DB Namespace